{
  "recipes": [
    {
      "id": "1",
      "title": "Lobiani",
      "img": "https://storage.georgia.travel/images/lobiani-gnta.webp",
      "descriptionShort":
      "Lobiani is a traditional Georgian pastry filled with seasoned mashed beans. It is similar to khachapuri but uses a hearty bean filling instead of cheese. The dough is typically baked or pan-fried, resulting in a crispy, golden crust with a soft, savory interior.",
      "ingredientNames": [
        "flour",
        "Kidney beans",
        "Butter",
        "Bay leaves",
        "Garlic",
        "Salt",
        "Water"
      ],
      "ingredientQuantities": ["500g", "500g", "100g", "5p", "2c", "20g", "500g"],
      "cookingInstructions": "Cook the Beans: If using dried beans, soak 250g (1 ½ cups) red kidney beans overnight in water.      Drain, rinse, and boil in fresh water for 1.5–2 hours until soft.      Drain and mash into a coarse paste (not too smooth).      (If using canned beans, simply drain and mash them.)      Sauté the Onion & Garlic:      Heat 2 tbsp oil or butter in a pan over medium heat.      Add 1 chopped onion and sauté until golden brown.      Stir in 2 minced garlic cloves and cook for 1 minute.      Season the Filling:      Add the mashed beans to the pan.      Season with 1 tsp salt, ½ tsp black pepper, and ½ tsp ground coriander (optional).      Stir well and cook for 3-5 minutes until flavors combine.      (Optional: Add 50-100g chopped smoked ham or bacon for Rachuli Lobiani.)      Let the filling cool completely before assembling.      Step 2: Prepare the Dough      Activate the Yeast:      In a bowl, mix 7g (2 tsp) dry yeast with 250ml (1 cup) warm water and 1 tsp sugar.      Let it sit for 5-10 minutes until foamy.      Make the Dough:      In a large bowl, combine 500g (4 cups) flour and 1 tsp salt.      Add the yeast mixture and 2 tbsp oil or melted butter.      Knead for 7-10 minutes until soft and elastic.      Cover with a damp cloth and let it rise for 1-1.5 hours, until doubled in size.      Step 3: Assemble the Lobiani      Divide and Roll the Dough:      Punch down the risen dough and divide it into 2-4 equal pieces (depending on size preference).      Roll each piece into a flat circle (about 1 cm thick and 20-25 cm wide).      Fill the Dough:      Place a generous amount of bean filling in the center of the dough.      Gather the edges and seal tightly, forming a pouch.      Flip it over and gently flatten into a round disc (about 1.5 cm thick).      Step 4: Cook the Lobiani      Option 1: Bake (Traditional Method)      8. Preheat the Oven to 200°C (400°F).      9. Transfer the shaped Lobiani to a baking sheet lined with parchment paper.      10. Brush with melted butter for a golden crust (optional).      11. Bake for 20-25 minutes until golden brown."
    },
    {
        "id": "2",
        "title": "Khachapuri",
        "img": "https://storage.georgia.travel/images/ajarian-khachapuri-georgia.webp",
        "descriptionShort":
        "Khachapuri is a traditional Georgian cheese-filled bread, often considered the country's national dish. It comes in various regional styles, with the most famous being Adjarian Khachapuri, shaped like a boat and topped with a runny egg and butter. The dough is soft and fluffy, while the filling typically consists of sulguni or imeretian cheese. Khachapuri is rich, savory, and best enjoyed fresh out of the oven",
        "ingredientNames": ["Cheese", "Butter", "Matsoni", "Egg", "Salt", "Water"
        ],
        "ingredientQuantities": ["500g", "100g", "50p", "2p", "20g", "500g"],
        "cookingInstructions": "Step 1: Prepare the DoughIn a bowl, mix 7g (2 tsp) dry yeast with 1 tsp sugar and 250ml (1 cup) warm milk or water. Let it sit for 5-10 minutes until foamy. In a large mixing bowl, combine 500g (4 cups) all-purpose flour and 1 tsp salt. Add the yeast mixture and 2 tbsp vegetable oil or melted butter. Knead the dough for 7-10 minutes until soft and elastic. Cover with a damp cloth and let it rise for 1-1.5 hours, until doubled in size.Step 2: Prepare the Cheese FillingIn a bowl, mix 300g (2 cups) grated sulguni or feta cheese with 200g (1 ½ cups) mozzarella or imeretian cheese. If desired, add 1 egg for a creamier texture.Step 3: Shape the KhachapuriPunch down the dough and divide it into 2-4 equal pieces, depending on the size. Roll each piece into an oval or round shape, about 1 cm thick. For Adjarian Khachapuri, shape the dough into a boat, leaving space in the center for the filling.Step 4: Fill and BakePreheat the oven to 220°C (430°F). Place the shaped dough on a parchment-lined baking sheet. Fill the center with the cheese mixture. Bake for 15-20 minutes, until golden brown.Step 5: Add the Egg (Optional, for Adjarian Khachapuri)Remove from the oven, make a small well in the center, and crack an egg on top. Return to the oven for 2-3 minutes, just until the egg is slightly set but still runny."
      },
      {
        "id": "3",
        "title": "Khinkali",
        "img": "https://cdn.tasteatlas.com/images/dishes/fa2ce0753c77428ea4275d382a1d867d.jpg?w=600",
        "descriptionShort": "Khinkali are traditional Georgian dumplings filled with spiced meat (usually beef, pork, or lamb) and a flavorful broth inside. They are shaped with a twisted top, which acts as a handle for eating. The most common variations include Kalakuri Khinkali (with herbs) and Mtiuluri Khinkali (without herbs).",
        "ingredientNames": ["flour", "Butter", "Egg", "Salt", "Water", "Ground beef, pork, or lamb (or a mix)", "Onion"
        ],
        "ingredientQuantities": ["500g", "100g", "2p", "20g", "500g", "500g", "1p"],
        "cookingInstructions": "Step 1: Prepare the DoughIn a large bowl, mix 500g flour and 1 tsp salt. Gradually add 250ml warm water, mixing with a spoon or hands. Knead for 8-10 minutes until smooth and elastic. Cover with a cloth and let it rest for 30 minutes.Step 2: Make the FillingIn a bowl, mix ground meat, onion, garlic, salt, black pepper, cumin, and red pepper flakes. Gradually add cold water or broth, stirring until the mixture becomes juicy and slightly soupy. If using, mix in chopped cilantro or parsley.Step 3: Shape the KhinkaliRoll out the dough to 2mm thickness and cut out 10-12 cm (4-5 inch) circles. Place 1-2 tbsp of filling in the center. Gather the edges and pleat them tightly to form a twisted top (aim for at least 15 folds). Pinch to seal.Step 4: Boil the KhinkaliBring a large pot of salted water to a gentle boil. Drop in the khinkali one by one, stirring carefully to prevent sticking. Boil for 7-10 minutes, until they float and the dough is cooked through.Step 5: ServeDrain and serve hot, sprinkled with black pepper. Hold the twisted top, take a bite, sip the juicy broth, and enjoy! (Don't eat the top—it’s just a handle!)"
      },
      {
        "id": "4",
        "title": "Sushi",
        "img": "https://static.toiimg.com/photo/105698192/105698192.jpg",
        "descriptionShort": "Sushi is a traditional Japanese dish consisting of vinegared rice combined with various ingredients such as raw or cooked seafood, vegetables, and seaweed (nori). It comes in different forms, including maki (rolled sushi), nigiri (hand-pressed rice with toppings), and sashimi (sliced raw fish without rice). Sushi is often served with soy sauce, wasabi, and pickled ginger. It is known for its fresh flavors, delicate presentation, and cultural significance in Japanese cuisine",
        "ingredientNames": ["sushi rice", "water", "rice vinegar", "Salt", "sugar"],
        "ingredientQuantities": ["200g", "100g", "20g", "20g", "1tsp"],
        "cookingInstructions": "Step 1: Prepare the Sushi Rice Rinse the Rice – Wash 2 cups of sushi rice under cold water until the water runs clear. Cook the Rice – In a rice cooker or pot, cook the rice with 2 ½ cups of water. If using a pot, bring it to a boil, then cover and simmer on low for 15 minutes. Remove from heat and let it rest for 10 minutes. Season the Rice – In a small bowl, mix ¼ cup rice vinegar, 1 tbsp sugar, and ½ tsp salt. Heat until the sugar dissolves. Gently fold the mixture into the cooked rice and let it cool to room temperature.      Step 2: Prepare Fillings & Toppings      Slice the Fish & Vegetables – Cut raw fish (like tuna or salmon) into thin slices. Slice vegetables like cucumber, avocado, or carrots into thin strips.      Prepare Other Ingredients – If using shrimp, boil and peel them. If using tamagoyaki (Japanese omelet), slice it into thin strips.      Step 3: Assemble the Sushi      For Maki Rolls (Nori Rolls)      Place a sheet of nori (shiny side down) on a bamboo sushi mat.      Spread a thin layer of sushi rice over the nori, leaving 1 inch (2.5 cm) at the top edge.      Arrange the fillings (fish, avocado, cucumber, etc.) in a line near the bottom edge.      Using the bamboo mat, roll tightly from the bottom, pressing gently. Seal the edge with a little water.      Cut into 6-8 even pieces with a sharp, wet knife.      For Nigiri (Hand-Pressed Sushi)      Wet your hands and shape a small oval ball of sushi rice (about 1 tbsp).      Place a slice of fish on top and press gently to secure.      Optional: Brush with soy sauce or add a tiny bit of wasabi under the fish.      Step 4: Serve & Enjoy      Arrange sushi on a plate and garnish with sesame seeds or sriracha mayo (optional).      Serve with soy sauce, wasabi, and pickled ginger.      Enjoy fresh! 😊🍣"
      },
      {
        "id": "5",
        "title": "Paella",
        "img": "https://res.cloudinary.com/tienda-com/image/upload/f_auto/q_auto/c_fill,w_742/dpr_2.0/v1/recipes/mixed-seafood-paella",
        "descriptionShort": "Paella is a traditional Spanish rice dish originating from Valencia, known for its vibrant flavors and colorful presentation. It is typically cooked in a wide, shallow pan and features saffron-infused rice, which gives it a golden hue. Paella can include a variety of ingredients such as seafood (shrimp, mussels, squid), chicken, rabbit, chorizo, and vegetables. The dish is famous for its socarrat — the crispy, caramelized rice layer at the bottom. It is a symbol of Spanish cuisine and is best enjoyed freshly cooked with friends and family",
        "ingredientNames": ["Short-grain rice", "Chicken or seafood broth", "Saffron threads", "Smoked paprika", "Black pepper", "Salt"],
        "ingredientQuantities": ["2cps", "2cps", "2tsp", "1tsp", "1tsp"],
        "cookingInstructions": "Step 1: Prepare IngredientsClean and prep all seafood (if using).Cut chicken into bite-sized pieces.Dice onions, mince garlic, and slice bell peppers.Soak saffron threads in 2 tablespoons of warm water.Step 2: Heat the Pan & Sauté ProteinsHeat 3 tbsp olive oil in a large paella pan over medium heat.Add chicken (and chorizo, if using) and brown for 5–7 minutes.Remove and set aside.Step 3: Sauté Vegetables & RiceIn the same pan, sauté onions, garlic, and bell peppers for 2–3 minutes.Add grated tomato and cook until it thickens (2 minutes).Stir in 2 cups short-grain rice, coating it with oil and toasting for 1–2 minutes.Step 4: Add Broth & SaffronPour in 4 cups of hot broth and the saffron water.Add 1 tsp smoked paprika, salt, and pepper.Stir once to distribute ingredients evenly, then do not stir again to allow proper rice cooking.Step 5: Cook & Add SeafoodSimmer uncovered on medium heat for 15–20 minutes, letting the rice absorb the liquid.Arrange shrimp, mussels, and squid on top during the last 10 minutes.Cover with foil if necessary to ensure even cooking.Step 6: Create the “Socarrat” (Crispy Rice Bottom)Increase heat for 1–2 minutes at the end to form the caramelized layer at the bottom.Step 7: Rest & ServeRemove from heat and let the paella rest for 5 minutes.Garnish with fresh parsley and lemon wedges.Enjoy your authentic Spanish Paella! 🇪🇸🥘🍋"
      }
  ]
}
